%% Предварительные приготовления

clear;
clc;

name = "current_contour"; % имя модели в симулинк

%% Основыне параметры привода
R = 0.99 ;

T_e = 0.0068 ;
T_pow = 0.0004 ;

kw = 0.98 ;
km = 0.98 ;
k_pow = 10 ; %10
k_curr = 1 ;
k_spd = 1 ;

J = 0.00073 ;
i = 262 ; %262 ;

%% _______________________Расчет регултора тока_________________________ %%



% П - регулятор тока
kp = 0.42 ; %0.844
% ПИ - регулятор тока

kp_pi = 123.75 ;%0.844

r_coeff = 1 / (2*T_pow) ;
kp_pi_ctrl = r_coeff*R / (k_curr * k_pow);
ki = 1/T_e ;  %124
sim(name) ;
